snlkuharlocal/src/Documents/Табель/Табель.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Табель</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаСотрудников</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>EnumRef.СостояниеТабеля</types>
      </type>
    </attributes>
    <attributes>
      <name>Переработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентПереработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСмены</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСмены</name>
      <type>
        <types>EnumRef.СостояниеТабеля</types>
      </type>
    </attributes>
    <attributes>
      <name>Вход</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выход</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработанноеВремя</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ошибки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроходыЗаДень</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроходыСКУД1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроходыСКУД2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПереработкаСКУД</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/СостояниеТабеля/СостояниеТабеля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеТабеля</name>
  <enumValues>
    <name>ДневнаяСмена</name>
    <comment>Дневная смена</comment>
  </enumValues>
  <enumValues>
    <name>НочнаяСмена</name>
    <comment>Ночная смена</comment>
  </enumValues>
  <enumValues>
    <name>РабочийДень1</name>
    <comment>Первая смена</comment>
  </enumValues>
  <enumValues>
    <name>РабочийДень2</name>
    <comment>Вторая смена</comment>
  </enumValues>
  <enumValues>
    <name>РабочийДеньНочнаяСмена</name>
    <comment>Ночная смена</comment>
  </enumValues>
  <enumValues>
    <name>ВыходнойДень</name>
    <comment>Выходной день</comment>
  </enumValues>
  <enumValues>
    <name>Больничный</name>
    <comment>Больничный лист</comment>
  </enumValues>
  <enumValues>
    <name>ОтпускОчередной</name>
    <comment>Отпуск очередной</comment>
  </enumValues>
  <enumValues>
    <name>ОтпускБезСохранения</name>
    <comment>Отпуск без сохранения з/п (за свой счет)</comment>
  </enumValues>
  <enumValues>
    <name>Невыход</name>
    <comment>Невыход (по невыясненным прихинам)</comment>
  </enumValues>
  <enumValues>
    <name>Декрет</name>
    <comment>Декретный отпуск</comment>
  </enumValues>
  <enumValues>
    <name>ДополнительныйЛьготныйДень</name>
    <comment>Дополнительный льготный день (для инвалидов)</comment>
  </enumValues>
  <enumValues>
    <name>РаботаВПраздники</name>
    <comment>Работа в праздничный (выходной) день</comment>
  </enumValues>
  <enumValues>
    <name>ОтпускВСчетОтработанногоВыходного</name>
    <comment>Отпуск в счет отработанного выходного</comment>
  </enumValues>
  <enumValues>
    <name>ВремяИсполненияГосударственныхОбязанностей</name>
    <comment>Время исполнения государственных обязанностей</comment>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
    <comment>Командировка</comment>
  </enumValues>
  <enumValues>
    <name>Прогул</name>
    <comment>Прогул</comment>
  </enumValues>
  <enumValues>
    <name>Уволен</name>
    <comment>Уволен</comment>
  </enumValues>
  <enumValues>
    <name>РабочийДень</name>
    <comment>Рабочий день</comment>
  </enumValues>
  <enumValues>
    <name>Переработки</name>
  </enumValues>
  <enumValues>
    <name>ПриостановлениеДоговора</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/Табель/ManagerModule.bsl
Процедура ПересчитатьДанныеВремениСтроки(ТекущиеДанные) экспорт     
	ТипСмены = ТекущиеДанные.ТипСмены;
	
	если не ЗначениеЗаполнено(ТипСмены) тогда
		ТипСмены = ТекущиеДанные.Значение;
	КонецЕсли;
	
	Проходы1 = СтрЗаменить(ТекущиеДанные.ПроходыСКУД1,"¶",Символы.ПС); 
	Проходы2 = СтрЗаменить(ТекущиеДанные.ПроходыСКУД2,"¶",Символы.ПС);       	
	
	Если ТипСмены = Перечисления.СостояниеТабеля.НочнаяСмена или  ТипСмены = Перечисления.СостояниеТабеля.РабочийДеньНочнаяСмена Тогда     
		МассивПроходов = ПроходыНочнойСмены(Проходы1,Проходы2);
	Иначе	
		МассивПроходов = РазложитьСтрокуВМассивПодстрок1(Проходы1, Символы.ПС);
	КонецЕсли; 
	
	Вездеход = ПолучитьРеквизитШапки(ТекущиеДанные.Сотрудник,"ПропускВездеход","Справочник");
	
	
	СтруктураПроходов = СтрокаПроходыВСтруктуру(МассивПроходов,ТипСмены);
	тзПроходы =СтруктураПроходов.тз;  
	
	если тзПроходы.количество() = 0 тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Выход = СтруктураПроходов.ВремяВыхода;
	ТекущиеДанные.Вход = СтруктураПроходов.ВремяВхода;

	
	
	
		
	Если НЕ ТекущиеДанные.Вход = Дата(1,1,1) И НЕ ТекущиеДанные.Выход = Дата(1,1,1) Тогда        
		ЭтоБылВыходной = ложь;
		Если ТипСмены = Перечисления.СостояниеТабеля.ДневнаяСмена Тогда
			ВремяНачало = Дата(1,1,1,8,0,0);	
			ВремяОкончание = Дата(1,1,1,20,0,0);	
		ИначеЕсли ТипСмены = Перечисления.СостояниеТабеля.НочнаяСмена Тогда
			ВремяНачало = Дата(1,1,1,20,0,0);	
			ВремяОкончание = Дата(1,1,2,8,0,0);    
		ИначеЕсли ТипСмены = Перечисления.СостояниеТабеля.РабочийДень1 Тогда
			ВремяНачало = Дата(1,1,1,8,0,0);	
			ВремяОкончание = Дата(1,1,1,17,0,0);  
		ИначеЕсли ТипСмены = Перечисления.СостояниеТабеля.РабочийДень2 Тогда
			ВремяНачало = Дата(1,1,1,13,0,0);	
			ВремяОкончание = Дата(1,1,1,22,0,0);  
		ИначеЕсли ТипСмены = Перечисления.СостояниеТабеля.РабочийДеньНочнаяСмена Тогда
			ВремяНачало = Дата(1,1,1,20,0,0);	
			ВремяОкончание = Дата(1,1,2,8,0,0);  
		иначе     
			ЭтоБылВыходной = Истина;
			ВремяНачало = ПустаяДата();	
			ВремяОкончание = ПустаяДата();  
		КонецЕсли;
		
  
		Переработка = Дата(1,1,1);
		Для Индекс = 0 По  тзПроходы.Количество()-1 Цикл      
			тзПроходы[Индекс].Номер = Индекс + 1;	
			ПересчитатьСтроку(тзПроходы[Индекс],тзПроходы,ТипСмены);

			Переработка = Переработка + (тзПроходы[Индекс].Переработка - Дата(1,1,1)) ;
			
			Если Индекс = 0 Тогда
				Отсутствие = тзПроходы[Индекс].Отсутствие;
				ПрисутствиеИтог = тзПроходы[Индекс].Присутствие;
				ОтработаноИтог = тзПроходы[Индекс].Отработано;
			Иначе
				Отсутствие = Отсутствие + (тзПроходы[Индекс].Отсутствие - Дата(1,1,1));
				ПрисутствиеИтог = ПрисутствиеИтог + (тзПроходы[Индекс].Присутствие - Дата(1,1,1));
				ОтработаноИтог = ОтработаноИтог + (тзПроходы[Индекс].Отработано - Дата(1,1,1));
			КонецЕсли;
		КонецЦикла;	
		Если Вездеход Тогда
			ТекущиеДанные.ОтработанноеВремя = тзПроходы[тзПроходы.Количество()-1].Выход-(тзПроходы[0].Вход-Дата(1,1,1));  
		Иначе		
			ТекущиеДанные.ОтработанноеВремя = ?(Отсутствие>Дата(1,1,1,1,0,0),ОтработаноИтог,ОтработаноИтог+(Отсутствие-Дата(1,1,1))-3600);  
		КонецЕсли;
		

		ПереработкаЧас = Час(Переработка);
		ПереработкаМинуты = Минута(Переработка);
		Если ПереработкаМинуты>40 Тогда
			ПереработкаЧас = ПереработкаЧас+1;	
		КонецЕсли;
		Если ТипСмены = Перечисления.СостояниеТабеля.ВыходнойДень 
			ИЛИ ТипСмены = Перечисления.СостояниеТабеля.Больничный 
			ИЛИ ТипСмены = Перечисления.СостояниеТабеля.ОтпускОчередной 
			Тогда
			ВсегоПереработка = ?(Отсутствие>Дата(1,1,1,1,0,0),ОтработаноИтог,ОтработаноИтог+(Отсутствие-Дата(1,1,1))-3600) + (Переработка-Дата(1,1,1));
			ВсегоПереработкаЧас = Час(ВсегоПереработка);
			ВсегоПереработкаМинуты = Минута(ВсегоПереработка);
			Если ВсегоПереработкаМинуты>40 Тогда
				ВсегоПереработкаЧас = ВсегоПереработкаЧас+1;	
			КонецЕсли;
			
			Переработка = Дата(1,1,1,ВсегоПереработкаЧас,0,0); 
		Иначе		
			Переработка = Дата(1,1,1,ПереработкаЧас,0,0); 
		КонецЕсли;
		
		
		//////////////////////////////////////////////////////
		//
		//Если (ТипСмены = Перечисления.СостояниеТабеля.РабочийДеньНочнаяСмена или  ТипСмены = Перечисления.СостояниеТабеля.НочнаяСмена) и (ТекущиеДанные.Выход - ТекущиеДанные.Вход)<0 Тогда
		//	СтруктураПрисутствие = ЧислоВоВремя(86400+(ТекущиеДанные.Выход - ТекущиеДанные.Вход));	
		//иначе    
		//	//СтруктураПрисутствие = ЧислоВоВремя(ТекущиеДанные.Выход - ТекущиеДанные.Вход);    
		//	СтруктураПрисутствие = ЧислоВоВремя(СекундОтработано);
		//КонецЕсли; 
		//
		//Присутствие = Дата(1,1,1,СтруктураПрисутствие.Часы, СтруктураПрисутствие.Минуты,0); 
		//
		//Отсутствие = СекундОтсутствия;
		//Отсутствие = Макс(0,Отсутствие - 3600);  
		//ЧасыОтсутствие = Отсутствие/3600;
		//если ЧасыОтсутствие - Цел(ЧасыОтсутствие)>0.6666 тогда 
		//	ЧасыОтсутствие = Цел(ЧасыОтсутствие)+1;
		//иначе			
		//	ЧасыОтсутствие = Цел(ЧасыОтсутствие);			
		//КонецЕсли;        
		//Отсутствие = ЧасыОтсутствие*3600;
		
		//Если ТекущиеДанные.Выход > ВремяНачало Тогда
			//СтруктураОтработано = ЧислоВоВремя(ТекущиеДанные.Выход - Макс(ТекущиеДанные.Вход,ВремяНачало));  
			//если Вездеход тогда    
			//	СтруктураОтработано = ЧислоВоВремя(СтруктураПроходов.Отработано-3600);
			//иначе    
			//	СтруктураОтработано = ЧислоВоВремя(СтруктураПроходов.Отработано - Отсутствие);  
			//КонецЕсли;       
			//
			//ТекущиеДанные.ОтработанноеВремя = Дата(1,1,1,СтруктураОтработано.Часы, СтруктураОтработано.Минуты,0);   
			//ТекущиеДанные.ОтработанноеВремя = Отработано;

		//КонецЕсли;     
		
		
		//Если НЕ тзПроходы.Индекс(ТекущиеДанные) = тзПроходы.Количество() - 1 И ТекущиеДанные.Выход<ВремяОкончание И ТекущиеДанные.Выход>ВремяНачало И НЕ тзПроходы[тзПроходы.Индекс(ТекущиеДанные)+1].Вход = Дата(1,1,1) Тогда
		//	//СтруктураОтсутствие = ЧислоВоВремя(тзПроходы[тзПроходы.Индекс(ТекущиеДанные)+1].Вход - ТекущиеДанные.Выход);    
		//	//СтруктураОтсутствие = ЧислоВоВремя(ТекущиеДанные.Выход - тзПроходы[тзПроходы.Индекс(ТекущиеДанные)+1].Вход );   
		//	СтруктураОтсутствие = ЧислоВоВремя(СтруктураПроходов.Отсутствие);
		//	Отсутствие = Дата(1,1,1,СтруктураОтсутствие.Часы, СтруктураОтсутствие.Минуты,0);
		//Иначе
		//	Отсутствие = Дата(1,1,1);
		//КонецЕсли;     
		
		
		//Если ТекущиеДанные.Выход > ВремяОкончание Тогда
		//	СтруктураПереработка = ЧислоВоВремя(ТекущиеДанные.Выход - Макс(ТекущиеДанные.Вход,ВремяОкончание));	
		//	ТекущиеДанные.Переработки = Дата(1,1,1,СтруктураПереработка.Часы, СтруктураПереработка.Минуты,0);	
		//	ТекущиеДанные.ОтработанноеВремя = ТекущиеДанные.ОтработанноеВремя - (Дата(1,1,1,СтруктураПереработка.Часы, СтруктураПереработка.Минуты,0)-Дата(1,1,1));	
		//КонецЕсли;   
		
		ТекущиеДанные.ПроходыЗадень = ТЗвПроходы(тзПроходы);
		//
		//если ЭтоБылВыходной  тогда 
		//	ТекущиеДанные.Переработки = ТекущиеДанные.ОтработанноеВремя;
		//КонецЕсли;      
		//
		//ТекущиеДанные.ОтработанноеВремя = ТекущиеДанные.ОтработанноеВремя - ТекущиеДанные.Переработки;
		
		
	КонецЕсли;
	
	
	
КонецПроцедуры    

Функция ЧислоВоВремя(Знач КоличествоСекунд)
	
	Перем Часы, Минуты, Секунды;
	
	//получаем часы
	Часы = Цел(КоличествоСекунд / 3600);
	//считаем остаток
	КоличествоСекунд = КоличествоСекунд % 3600;
	//получаем минуты
	Минуты = Цел(КоличествоСекунд / 60);//в минуте 60 сек
	//остались секунды
	Секунды = КоличествоСекунд % 60;
	
	Возврат Новый Структура("Часы, Минуты, Секунды", Часы, Минуты, Секунды);
	
КонецФункции




Функция РазложитьСтрокуВМассивПодстрок1(Знач Значение, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, 
	СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Если Разделитель = "," 
		И ПропускатьПустыеСтроки = Неопределено 
		И СокращатьНепечатаемыеСимволы Тогда 
		
		Результат = СтрРазделить(Значение, ",", Ложь);
		Для Индекс = 0 По Результат.ВГраница() Цикл
			Результат[Индекс] = СокрЛП(Результат[Индекс])
		КонецЦикла;
		Возврат Результат;
		
	КонецЕсли;
	
	Результат = Новый Массив;
	
	// Для обеспечения обратной совместимости.
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Значение) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = СтрНайти(Значение, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Значение, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Значение = Сред(Значение, Позиция + СтрДлина(Разделитель));
		Позиция = СтрНайти(Значение, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Значение) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Значение));
		Иначе
			Результат.Добавить(Значение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 


Функция СтрокаПроходыВСтруктуру(МассивПроходы,ТипСмены)           
	тз=Новый ТаблицаЗначений;
	тз.Колонки.Добавить("Номер",Новый ОписаниеТипов("Число",
	Новый КвалификаторыЧисла(4, 0, ДопустимыйЗнак.Любой)));
	тз.Колонки.Добавить("Вход", Новый ОписаниеТипов("Дата", , ,
	Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	тз.Колонки.Добавить("Выход", Новый ОписаниеТипов("Дата", , ,
	Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	тз.Колонки.Добавить("Присутствие", Новый ОписаниеТипов("Дата", , ,
	Новый КвалификаторыДаты(ЧастиДаты.Время)));
	тз.Колонки.Добавить("Отработано", Новый ОписаниеТипов("Дата", , ,
	Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	тз.Колонки.Добавить("Переработка", Новый ОписаниеТипов("Дата", , ,
	Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	тз.Колонки.Добавить("Отсутствие", Новый ОписаниеТипов("Дата", , ,
	Новый КвалификаторыДаты(ЧастиДаты.Время)));
	
	Если ТипСмены = Перечисления.СостояниеТабеля.ДневнаяСмена Тогда
		ВремяНачало = Дата(1,1,1,8,0,0);	
		ВремяОкончание = Дата(1,1,1,20,0,0);	
	ИначеЕсли ТипСмены = Перечисления.СостояниеТабеля.НочнаяСмена Тогда
		ВремяНачало = Дата(1,1,1,20,0,0);	
		ВремяОкончание = Дата(1,1,2,8,0,0);  
	ИначеЕсли ТипСмены = Перечисления.СостояниеТабеля.РабочийДень1 Тогда
		ВремяНачало = Дата(1,1,1,8,0,0);	
		ВремяОкончание = Дата(1,1,1,17,0,0);  
	ИначеЕсли ТипСмены = Перечисления.СостояниеТабеля.РабочийДень2 Тогда
		ВремяНачало = Дата(1,1,1,13,0,0);	
		ВремяОкончание = Дата(1,1,1,22,0,0);  
	ИначеЕсли ТипСмены = Перечисления.СостояниеТабеля.РабочийДеньНочнаяСмена Тогда
		ВремяНачало = Дата(1,1,1,20,0,0);	
		ВремяОкончание = Дата(1,1,2,8,0,0);   
	иначе
		ВремяНачало = ПустаяДата();	
		ВремяОкончание = ПустаяДата();   
	КонецЕсли;
	
	Индекс = -1;
	НовыйМассив = Новый Массив;  
	Добавлено = Ложь;                   
	Присутствие=0;
	Отработано=0;
	Для каждого ЭлементМассива Из МассивПроходы Цикл      
		Индекс = Индекс + 1;                
		Если Не Добавлено Тогда
			НоваяСтрока = тз.Добавить();      
			НоваяСтрока.Номер = тз.Индекс(НоваяСтрока)+1;
			Если СтрНайти(ЭлементМассива,"вход")>0 Тогда
				Если ТипСмены = Перечисления.СостояниеТабеля.НочнаяСмена Тогда   
					Если Час(СтрокаВоВремя(ЭлементМассива))<12 Тогда
						НоваяСтрока.Вход = СтрокаВоВремя(ЭлементМассива)+86400;     
					Иначе		
						НоваяСтрока.Вход = СтрокаВоВремя(ЭлементМассива);     
					КонецЕсли;
				Иначе		
					НоваяСтрока.Вход = СтрокаВоВремя(ЭлементМассива);     
				КонецЕсли;
				Добавлено=Истина;
			Иначе	  
				Если ТипСмены = Перечисления.СостояниеТабеля.НочнаяСмена Тогда   
					Если Час(СтрокаВоВремя(ЭлементМассива))<12 Тогда
						НоваяСтрока.Выход = СтрокаВоВремя(ЭлементМассива)+86400;     
					Иначе		
						НоваяСтрока.Выход = СтрокаВоВремя(ЭлементМассива);     
					КонецЕсли;
				Иначе		
					НоваяСтрока.Выход = СтрокаВоВремя(ЭлементМассива);     
				КонецЕсли;
				Если НЕ НоваяСтрока.Вход=Дата(1,1,1) И НЕ НоваяСтрока.Выход=Дата(1,1,1) Тогда
					СтруктураПрисутствие = ЧислоВоВремя(?(НоваяСтрока.Выход < НоваяСтрока.Вход,НоваяСтрока.Выход - НоваяСтрока.Вход+86400,НоваяСтрока.Выход - НоваяСтрока.Вход));
					СтруктураОтработано = ЧислоВоВремя(?(НоваяСтрока.Выход < НоваяСтрока.Вход,НоваяСтрока.Выход - НоваяСтрока.Вход+86400,НоваяСтрока.Выход - НоваяСтрока.Вход));
					НоваяСтрока.Присутствие = Дата(1,1,1,СтруктураПрисутствие.Часы, СтруктураПрисутствие.Минуты,0);
					НоваяСтрока.Отработано = Дата(1,1,1,СтруктураОтработано.Часы, СтруктураОтработано.Минуты,0)-60;
					Присутствие = Присутствие + ?(НоваяСтрока.Выход < НоваяСтрока.Вход,НоваяСтрока.Выход - НоваяСтрока.Вход+86400,НоваяСтрока.Выход - НоваяСтрока.Вход);
					Отработано = Отработано + НоваяСтрока.Выход - НоваяСтрока.Вход-60;
				КонецЕсли;
				Добавлено=Ложь;
			КонецЕсли;
		Иначе          
			Если СтрНайти(ЭлементМассива,"выход")>0 Тогда          
				Если ТипСмены = Перечисления.СостояниеТабеля.НочнаяСмена Тогда   
					Если Час(СтрокаВоВремя(ЭлементМассива))<12 Тогда
						НоваяСтрока.Выход = СтрокаВоВремя(ЭлементМассива)+86400;     
					Иначе		
						НоваяСтрока.Выход = СтрокаВоВремя(ЭлементМассива);     
					КонецЕсли;
				Иначе		
					НоваяСтрока.Выход = СтрокаВоВремя(ЭлементМассива);     
				КонецЕсли;
				Добавлено=Ложь;                   
				Если НЕ НоваяСтрока.Вход=Дата(1,1,1) И НЕ НоваяСтрока.Выход=Дата(1,1,1) Тогда
					СтруктураПрисутствие = ЧислоВоВремя(?(НоваяСтрока.Выход < НоваяСтрока.Вход,НоваяСтрока.Выход - НоваяСтрока.Вход+86400,НоваяСтрока.Выход - НоваяСтрока.Вход));
					// +++ {Кузнецов Сергей Владимирович [27.02.2024]
					СтруктураОтработано = ЧислоВоВремя(?(Мин(НоваяСтрока.Выход,ВремяОкончание) <  Макс(НоваяСтрока.Вход,ВремяНачало),0,Мин(НоваяСтрока.Выход,ВремяОкончание) - Макс(НоваяСтрока.Вход,ВремяНачало)));
					// }Кузнецов Сергей Владимирович +++ [27.02.2024]
					НоваяСтрока.Присутствие = Дата(1,1,1,СтруктураПрисутствие.Часы, СтруктураПрисутствие.Минуты,0);
					НоваяСтрока.Отработано = Дата(1,1,1,СтруктураОтработано.Часы, СтруктураОтработано.Минуты,0)-60;
					Присутствие = Присутствие + ?(НоваяСтрока.Выход < НоваяСтрока.Вход,НоваяСтрока.Выход - НоваяСтрока.Вход+86400,НоваяСтрока.Выход - НоваяСтрока.Вход);
					Отработано = Мин(НоваяСтрока.Выход,ВремяОкончание) - Макс(НоваяСтрока.Вход,ВремяНачало)+Отработано - 60;
				КонецЕсли;
			Иначе
				НоваяСтрока = тз.Добавить();  
				НоваяСтрока.Номер = тз.Индекс(НоваяСтрока)+1;                  
				// +++ {Кузнецов Сергей Владимирович [27.05.2025] (HELP-4948)
				//Если Час(СтрокаВоВремя(ЭлементМассива))<12 И ТипСмены = Перечисления.СостояниеТабеля.РабочийДеньНочнаяСмена Тогда
				Если Час(СтрокаВоВремя(ЭлементМассива))<12 И ТипСмены = Перечисления.СостояниеТабеля.НочнаяСмена Тогда
					// }Кузнецов Сергей Владимирович +++ [27.05.2025]
					НоваяСтрока.Вход = СтрокаВоВремя(ЭлементМассива)+86400;     
				Иначе		
					НоваяСтрока.Вход = СтрокаВоВремя(ЭлементМассива);     
				КонецЕсли;
				Добавлено=Истина;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;             
	Отсутствие = 0;
	Для каждого СтрокаТЗ Из тз Цикл    
		Если НЕ тз.Индекс(СтрокаТЗ) = тз.Количество() - 1 Тогда           
			Если НЕ тз[тз.Индекс(СтрокаТЗ)+1].Вход=Дата(1,1,1) И НЕ СтрокаТЗ.Вход=Дата(1,1,1) И НЕ СтрокаТЗ.Выход=Дата(1,1,1) Тогда
				СтруктураОтсутствие = ЧислоВоВремя(?(тз[тз.Индекс(СтрокаТЗ)+1].Вход - СтрокаТЗ.Выход < 0,тз[тз.Индекс(СтрокаТЗ)+1].Вход - СтрокаТЗ.Выход + 86400,тз[тз.Индекс(СтрокаТЗ)+1].Вход - СтрокаТЗ.Выход));  
				СтрокаТЗ.Отсутствие = Дата(1,1,1,СтруктураОтсутствие.Часы, СтруктураОтсутствие.Минуты,0);
				Отсутствие =  ?(тз[тз.Индекс(СтрокаТЗ)+1].Вход - СтрокаТЗ.Выход < 0,тз[тз.Индекс(СтрокаТЗ)+1].Вход - СтрокаТЗ.Выход + 86400,тз[тз.Индекс(СтрокаТЗ)+1].Вход - СтрокаТЗ.Выход)  + Отсутствие;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Ошибки=Ложь;
	Для каждого СтрокаТЗ Из тз Цикл    
		Если СтрокаТЗ.Вход=Дата(1,1,1) ИЛИ СтрокаТЗ.Выход=Дата(1,1,1) Тогда
			Ошибки = Истина;    
			Прервать;
		КонецЕсли;
	КонецЦикла;           
	
	ВремяВхода = тз[0].Вход;
	ВремяВыхода = тз[тз.Количество() - 1].Выход;   
	Возврат Новый Структура("тз, Отработано, Присутствие, Отсутствие, Состояние, ВремяВхода, ВремяВыхода, Ошибки",тз,Присутствие, Отработано, Отсутствие, ТипСмены, ВремяВхода, ВремяВыхода, Ошибки);
	
КонецФункции
  Функция ТЗвПроходы(ТЗ)     
	Текст ="";
	Для каждого СтрокаТЗ Из ТЗ Цикл       
		т=0;         
		Если НЕ СтрокаТЗ.Вход = Дата(1,1,1) Тогда
			Текст = Текст +Формат(СтрокаТЗ.Вход,"ДФ=ЧЧ:мм") + " вход";  
			
			Если НЕ ТЗ.Индекс(СтрокаТЗ)+1=ТЗ.Количество()  Тогда
				Текст = Текст + Символы.ПС;         
			Иначе 
				Если НЕ СтрокаТЗ.Выход = Дата(1,1,1) Тогда
					Текст = Текст + Символы.ПС;         
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если НЕ СтрокаТЗ.Выход = Дата(1,1,1) Тогда
			Текст = Текст +Формат(СтрокаТЗ.Выход,"ДФ=ЧЧ:мм") + " выход";   
			Если НЕ ТЗ.Индекс(СтрокаТЗ)+1=ТЗ.Количество() Тогда
				Текст = Текст + Символы.ПС;   
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Текст;
КонецФункции


Процедура ПересчитатьСтроку(ТекущиеДанные,тзПроходы,типСмены,ОбновлятьТипСмены = ложь) 
	Если НЕ ТекущиеДанные.Вход = Дата(1,1,1) И НЕ ТекущиеДанные.Выход = Дата(1,1,1) Тогда  
		Если ТипСмены = Перечисления.СостояниеТабеля.ДневнаяСмена Тогда
			ВремяНачало = Дата(1,1,1,8,0,0);	
			ВремяОкончание = Дата(1,1,1,20,0,0);	
		ИначеЕсли ТипСмены = Перечисления.СостояниеТабеля.НочнаяСмена Тогда
			ВремяНачало = Дата(1,1,1,20,0,0);	
			ВремяОкончание = Дата(1,1,2,8,0,0);    
		ИначеЕсли ТипСмены = Перечисления.СостояниеТабеля.РабочийДень1 Тогда
			ВремяНачало = Дата(1,1,1,8,0,0);	
			ВремяОкончание = Дата(1,1,1,17,0,0);  
		ИначеЕсли ТипСмены = Перечисления.СостояниеТабеля.РабочийДень2 Тогда
			ВремяНачало = Дата(1,1,1,13,0,0);	
			ВремяОкончание = Дата(1,1,1,22,0,0);  
		ИначеЕсли ТипСмены = Перечисления.СостояниеТабеля.РабочийДеньНочнаяСмена Тогда
			ВремяНачало = Дата(1,1,1,20,0,0);	
			ВремяОкончание = Дата(1,1,2,8,0,0);  
			иначе
			ВремяНачало = ПустаяДата();	
			ВремяОкончание = ПустаяДата(); 		
		КонецЕсли;

		Если (ТипСмены = Перечисления.СостояниеТабеля.РабочийДеньНочнаяСмена или  ТипСмены = Перечисления.СостояниеТабеля.НочнаяСмена) и (ТекущиеДанные.Выход - ТекущиеДанные.Вход)<0 Тогда
			СтруктураПрисутствие = ЧислоВоВремя(86400+(ТекущиеДанные.Выход - ТекущиеДанные.Вход));	
		иначе    
			СтруктураПрисутствие = ЧислоВоВремя(ТекущиеДанные.Выход - ТекущиеДанные.Вход);
		КонецЕсли; 
		
		ТекущиеДанные.Присутствие = Дата(1,1,1,СтруктураПрисутствие.Часы, СтруктураПрисутствие.Минуты,0);
		Если ТекущиеДанные.Выход > ВремяНачало Тогда
			СтруктураОтработано = ЧислоВоВремя(ТекущиеДанные.Выход - Макс(ТекущиеДанные.Вход,ВремяНачало));
			ТекущиеДанные.Отработано = Дата(1,1,1,СтруктураОтработано.Часы, СтруктураОтработано.Минуты,0);
		КонецЕсли;
		Если НЕ тзПроходы.Индекс(ТекущиеДанные) = тзПроходы.Количество() - 1 И ТекущиеДанные.Выход<ВремяОкончание И ТекущиеДанные.Выход>ВремяНачало И НЕ тзПроходы[тзПроходы.Индекс(ТекущиеДанные)+1].Вход = Дата(1,1,1) Тогда
			//Валетов + 17,03,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-9190
			// БЫЛО СтруктураОтсутствие = ЧислоВоВремя(тзПроходы[тзПроходы.Индекс(ТекущиеДанные)+1].Вход - ТекущиеДанные.Выход);
			Если тзПроходы[тзПроходы.Индекс(ТекущиеДанные)+1].Вход - ТекущиеДанные.Выход >= 0 Тогда
				СтруктураОтсутствие = ЧислоВоВремя(тзПроходы[тзПроходы.Индекс(ТекущиеДанные)+1].Вход - ТекущиеДанные.Выход); 
			Иначе
				СтруктураОтсутствие = ЧислоВоВремя(тзПроходы[тзПроходы.Индекс(ТекущиеДанные)+1].Вход +86400 - ТекущиеДанные.Выход);
			КонецЕсли;	
			//Валетов -  
			ТекущиеДанные.Отсутствие = Дата(1,1,1,СтруктураОтсутствие.Часы, СтруктураОтсутствие.Минуты,0);
		Иначе
			ТекущиеДанные.Отсутствие = Дата(1,1,1);
		КонецЕсли;
		Если ТекущиеДанные.Выход > ВремяОкончание Тогда
			СтруктураПереработка = ЧислоВоВремя(ТекущиеДанные.Выход - Макс(ТекущиеДанные.Вход,ВремяОкончание));	
			ТекущиеДанные.Переработка = Дата(1,1,1,СтруктураПереработка.Часы, СтруктураПереработка.Минуты,0);	
			ТекущиеДанные.Отработано = ТекущиеДанные.Отработано - (Дата(1,1,1,СтруктураПереработка.Часы, СтруктураПереработка.Минуты,0)-Дата(1,1,1));	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


Функция СтрокаВоВремя(Строка) 
	
	СтрВремя = СтрЗаменить(СтрЗаменить(Строка," вход","")," выход","");
	МассивВремя = РазложитьСтрокуВМассивПодстрок1(СтрВремя,":");
	ВремяЧас = Число(МассивВремя[0]);
	ВремяМин = Число(МассивВремя[1]);
	Время = Дата(1,1,1,ВремяЧас,ВремяМин,0);
	
	Возврат Время;
	
КонецФункции

Функция ПроходыНочнойСмены(Проходы1,Проходы2) 
	//Пытаемся отсечь проходы следующей ночной смены
	ПроходыДоКонцаСмены = Новый Массив;  
	ИндексЭлемента =-1;
	МассивПроходов = РазложитьСтрокуВМассивПодстрок1(Проходы2,Символы.ПС);
	Для каждого ЭлементМассива Из МассивПроходов Цикл
		ИндексЭлемента =ИндексЭлемента + 1;
		ИндексСледующегоЭлемента =ИндексЭлемента + 1;
		ВремяПрохода = СтрокаВоВремя(ЭлементМассива);    
		ВремяПрохода = ВремяПрохода+86400;
		ПроходыДоКонцаСмены.Добавить(ЭлементМассива);
		Если НЕ ИндексСледующегоЭлемента= МассивПроходов.Количество() Тогда
			ВремяСледующегоПрохода = СтрокаВоВремя(МассивПроходов[ИндексСледующегоЭлемента]);	  
			Если ВремяСледующегоПрохода - ВремяПрохода > 8*3600 Тогда
				Прервать;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//Пытаемся добавить проходы ночной смены до 00 часов
	МассивПроходов = РазложитьСтрокуВМассивПодстрок1(Проходы1,Символы.ПС);              
	ИндексПоследнего = МассивПроходов.ВГраница();
	
	Для Индекс = -ИндексПоследнего По 0 Цикл
		Значение = МассивПроходов[-Индекс];
		
		Время = СтрокаВоВремя(Значение);
		Если НЕ (-Индекс-1<0) Тогда
			СледующееЗначение = МассивПроходов[-Индекс-1];
			ПредыдущееВремя = СтрокаВоВремя(СледующееЗначение);
			ч=0;
			Если Время-ПредыдущееВремя < 8*3600 ИЛИ Индекс = 0 Тогда
				ПроходыДоКонцаСмены.Вставить(0,Значение);
			Иначе
				ПроходыДоКонцаСмены.Вставить(0,Значение);
				Прервать;
			КонецЕсли;
		Иначе	
			ПроходыДоКонцаСмены.Вставить(0,Значение);
		КонецЕсли;
	КонецЦикла;			
	Возврат ПроходыДоКонцаСмены;
	
КонецФункции
